#### SetFailureHandlingOptions Method

---

|  |
| --- |
| FailuresAccessor Class   See Also |

Sets failure handling options for the transaction currently being finished.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void SetFailureHandlingOptions( 	FailureHandlingOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFailureHandlingOptions ( _ 	options As FailureHandlingOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFailureHandlingOptions( 	FailureHandlingOptions^ options ) ``` |

#### Parameters

options
:   Type:  Autodesk.Revit.DB FailureHandlingOptions
     The failure handling options to be set for the transaction currently being finished.

# Remarks

If used with returning ProceedWithRollback from (pre)processing, allows to dismiss errors and roll back transaction without any further failures processing and silently for the user.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also

FailuresAccessor Class

Autodesk.Revit.DB Namespace